analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32520/Include/i2c_regs.h
#define MXC_F_I2C_CN_MST_POS                           1 /**< CN_MST Position */
#define MXC_F_I2C_CN_MST                               ((uint32_t)(0x1UL << MXC_F_I2C_CN_MST_POS)) /**< CN_MST Mask */

#define MXC_F_I2C_CN_GCEN_POS                          2 /**< CN_GCEN Position */
#define MXC_F_I2C_CN_GCEN                              ((uint32_t)(0x1UL << MXC_F_I2C_CN_GCEN_POS)) /**< CN_GCEN Mask */

#define MXC_F_I2C_CN_IRXM_POS                          3 /**< CN_IRXM Position */
#define MXC_F_I2C_CN_IRXM                              ((uint32_t)(0x1UL << MXC_F_I2C_CN_IRXM_POS)) /**< CN_IRXM Mask */

#define MXC_F_I2C_CN_ACK_POS                           4 /**< CN_ACK Position */
#define MXC_F_I2C_CN_ACK                               ((uint32_t)(0x1UL << MXC_F_I2C_CN_ACK_POS)) /**< CN_ACK Mask */

#define MXC_F_I2C_CN_SCLO_POS                          6 /**< CN_SCLO Position */
#define MXC_F_I2C_CN_SCLO                              ((uint32_t)(0x1UL << MXC_F_I2C_CN_SCLO_POS)) /**< CN_SCLO Mask */

#define MXC_F_I2C_CN_SDAO_POS                          7 /**< CN_SDAO Position */
#define MXC_F_I2C_CN_SDAO                              ((uint32_t)(0x1UL << MXC_F_I2C_CN_SDAO_POS)) /**< CN_SDAO Mask */

#define MXC_F_I2C_CN_SCL_POS                           8 /**< CN_SCL Position */
#define MXC_F_I2C_CN_SCL                               ((uint32_t)(0x1UL << MXC_F_I2C_CN_SCL_POS)) /**< CN_SCL Mask */

#define MXC_F_I2C_CN_SDA_POS                           9 /**< CN_SDA Position */
#define MXC_F_I2C_CN_SDA                               ((uint32_t)(0x1UL << MXC_F_I2C_CN_SDA_POS)) /**< CN_SDA Mask */

#define MXC_F_I2C_CN_SWOE_POS                          10 /**< CN_SWOE Position */
#define MXC_F_I2C_CN_SWOE                              ((uint32_t)(0x1UL << MXC_F_I2C_CN_SWOE_POS)) /**< CN_SWOE Mask */

#define MXC_F_I2C_CN_READ_POS                          11 /**< CN_READ Position */
#define MXC_F_I2C_CN_READ                              ((uint32_t)(0x1UL << MXC_F_I2C_CN_READ_POS)) /**< CN_READ Mask */

#define MXC_F_I2C_CN_SCLSTRD_POS                       12 /**< CN_SCLSTRD Position */
#define MXC_F_I2C_CN_SCLSTRD                           ((uint32_t)(0x1UL << MXC_F_I2C_CN_SCLSTRD_POS)) /**< CN_SCLSTRD Mask */

#define MXC_F_I2C_CN_SCLPPM_POS                        13 /**< CN_SCLPPM Position */
#define MXC_F_I2C_CN_SCLPPM                            ((uint32_t)(0x1UL << MXC_F_I2C_CN_SCLPPM_POS)) /**< CN_SCLPPM Mask */

/**@} end of group I2C_CN_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_ST I2C_ST
 * @brief    Status Register.
 * @{
 */
#define MXC_F_I2C_ST_BUS_POS                           0 /**< ST_BUS Position */
#define MXC_F_I2C_ST_BUS                               ((uint32_t)(0x1UL << MXC_F_I2C_ST_BUS_POS)) /**< ST_BUS Mask */

#define MXC_F_I2C_ST_RXE_POS                           1 /**< ST_RXE Position */
#define MXC_F_I2C_ST_RXE                               ((uint32_t)(0x1UL << MXC_F_I2C_ST_RXE_POS)) /**< ST_RXE Mask */

#define MXC_F_I2C_ST_RXF_POS                           2 /**< ST_RXF Position */
#define MXC_F_I2C_ST_RXF                               ((uint32_t)(0x1UL << MXC_F_I2C_ST_RXF_POS)) /**< ST_RXF Mask */

#define MXC_F_I2C_ST_TXE_POS                           3 /**< ST_TXE Position */
#define MXC_F_I2C_ST_TXE                               ((uint32_t)(0x1UL << MXC_F_I2C_ST_TXE_POS)) /**< ST_TXE Mask */

#define MXC_F_I2C_ST_TXF_POS                           4 /**< ST_TXF Position */
#define MXC_F_I2C_ST_TXF                               ((uint32_t)(0x1UL << MXC_F_I2C_ST_TXF_POS)) /**< ST_TXF Mask */

#define MXC_F_I2C_ST_CKMD_POS                          5 /**< ST_CKMD Position */
#define MXC_F_I2C_ST_CKMD                              ((uint32_t)(0x1UL << MXC_F_I2C_ST_CKMD_POS)) /**< ST_CKMD Mask */

#define MXC_F_I2C_ST_ST_POS                            8 /**< ST_ST Position */
#define MXC_F_I2C_ST_ST                                ((uint32_t)(0xFUL << MXC_F_I2C_ST_ST_POS)) /**< ST_ST Mask */

/**@} end of group I2C_ST_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_INT0 I2C_INT0
 * @brief    Interrupt Status Register.
 * @{
 */
#define MXC_F_I2C_INT0_DONEI_POS                       0 /**< INT0_DONEI Position */
#define MXC_F_I2C_INT0_DONEI                           ((uint32_t)(0x1UL << MXC_F_I2C_INT0_DONEI_POS)) /**< INT0_DONEI Mask */

#define MXC_F_I2C_INT0_IRXMI_POS                       1 /**< INT0_IRXMI Position */
#define MXC_F_I2C_INT0_IRXMI                           ((uint32_t)(0x1UL << MXC_F_I2C_INT0_IRXMI_POS)) /**< INT0_IRXMI Mask */

#define MXC_F_I2C_INT0_GCI_POS                         2 /**< INT0_GCI Position */
#define MXC_F_I2C_INT0_GCI                             ((uint32_t)(0x1UL << MXC_F_I2C_INT0_GCI_POS)) /**< INT0_GCI Mask */

#define MXC_F_I2C_INT0_AMI_POS                         3 /**< INT0_AMI Position */
#define MXC_F_I2C_INT0_AMI                             ((uint32_t)(0x1UL << MXC_F_I2C_INT0_AMI_POS)) /**< INT0_AMI Mask */

#define MXC_F_I2C_INT0_RXTHI_POS                       4 /**< INT0_RXTHI Position */
#define MXC_F_I2C_INT0_RXTHI                           ((uint32_t)(0x1UL << MXC_F_I2C_INT0_RXTHI_POS)) /**< INT0_RXTHI Mask */

#define MXC_F_I2C_INT0_TXTHI_POS                       5 /**< INT0_TXTHI Position */
#define MXC_F_I2C_INT0_TXTHI                           ((uint32_t)(0x1UL << MXC_F_I2C_INT0_TXTHI_POS)) /**< INT0_TXTHI Mask */

#define MXC_F_I2C_INT0_STOPI_POS                       6 /**< INT0_STOPI Position */
#define MXC_F_I2C_INT0_STOPI                           ((uint32_t)(0x1UL << MXC_F_I2C_INT0_STOPI_POS)) /**< INT0_STOPI Mask */

#define MXC_F_I2C_INT0_ADRACKI_POS                     7 /**< INT0_ADRACKI Position */
#define MXC_F_I2C_INT0_ADRACKI                         ((uint32_t)(0x1UL << MXC_F_I2C_INT0_ADRACKI_POS)) /**< INT0_ADRACKI Mask */

#define MXC_F_I2C_INT0_ARBERI_POS                      8 /**< INT0_ARBERI Position */
#define MXC_F_I2C_INT0_ARBERI                          ((uint32_t)(0x1UL << MXC_F_I2C_INT0_ARBERI_POS)) /**< INT0_ARBERI Mask */

#define MXC_F_I2C_INT0_TOERI_POS                       9 /**< INT0_TOERI Position */
#define MXC_F_I2C_INT0_TOERI                           ((uint32_t)(0x1UL << MXC_F_I2C_INT0_TOERI_POS)) /**< INT0_TOERI Mask */

#define MXC_F_I2C_INT0_ADRERI_POS                      10 /**< INT0_ADRERI Position */
#define MXC_F_I2C_INT0_ADRERI                          ((uint32_t)(0x1UL << MXC_F_I2C_INT0_ADRERI_POS)) /**< INT0_ADRERI Mask */

#define MXC_F_I2C_INT0_DATERI_POS                      11 /**< INT0_DATERI Position */
#define MXC_F_I2C_INT0_DATERI                          ((uint32_t)(0x1UL << MXC_F_I2C_INT0_DATERI_POS)) /**< INT0_DATERI Mask */

#define MXC_F_I2C_INT0_DNRERI_POS                      12 /**< INT0_DNRERI Position */
#define MXC_F_I2C_INT0_DNRERI                          ((uint32_t)(0x1UL << MXC_F_I2C_INT0_DNRERI_POS)) /**< INT0_DNRERI Mask */

