analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32520/Include/i2c_regs.h
#define MXC_F_I2C_RXCFG_RXTH_POS                       8 /**< RXCFG_RXTH Position */
#define MXC_F_I2C_RXCFG_RXTH                           ((uint32_t)(0xFUL << MXC_F_I2C_RXCFG_RXTH_POS)) /**< RXCFG_RXTH Mask */

/**@} end of group I2C_RXCFG_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_RX I2C_RX
 * @brief    Receive Control Register 1.
 * @{
 */
#define MXC_F_I2C_RX_RXCNT_POS                         0 /**< RX_RXCNT Position */
#define MXC_F_I2C_RX_RXCNT                             ((uint32_t)(0xFFUL << MXC_F_I2C_RX_RXCNT_POS)) /**< RX_RXCNT Mask */

#define MXC_F_I2C_RX_RXFIFO_POS                        8 /**< RX_RXFIFO Position */
#define MXC_F_I2C_RX_RXFIFO                            ((uint32_t)(0xFUL << MXC_F_I2C_RX_RXFIFO_POS)) /**< RX_RXFIFO Mask */

/**@} end of group I2C_RX_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_TXCFG I2C_TXCFG
 * @brief    Transmit Control Register 0.
 * @{
 */
#define MXC_F_I2C_TXCFG_TXPRELD_POS                    0 /**< TXCFG_TXPRELD Position */
#define MXC_F_I2C_TXCFG_TXPRELD                        ((uint32_t)(0x1UL << MXC_F_I2C_TXCFG_TXPRELD_POS)) /**< TXCFG_TXPRELD Mask */

#define MXC_F_I2C_TXCFG_TXRDYMMODE_POS                 1 /**< TXCFG_TXRDYMMODE Position */
#define MXC_F_I2C_TXCFG_TXRDYMMODE                     ((uint32_t)(0x1UL << MXC_F_I2C_TXCFG_TXRDYMMODE_POS)) /**< TXCFG_TXRDYMMODE Mask */

#define MXC_F_I2C_TXCFG_TXFSH_POS                      7 /**< TXCFG_TXFSH Position */
#define MXC_F_I2C_TXCFG_TXFSH                          ((uint32_t)(0x1UL << MXC_F_I2C_TXCFG_TXFSH_POS)) /**< TXCFG_TXFSH Mask */

#define MXC_F_I2C_TXCFG_TXTH_POS                       8 /**< TXCFG_TXTH Position */
#define MXC_F_I2C_TXCFG_TXTH                           ((uint32_t)(0xFUL << MXC_F_I2C_TXCFG_TXTH_POS)) /**< TXCFG_TXTH Mask */

/**@} end of group I2C_TXCFG_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_TX I2C_TX
 * @brief    Transmit Control Register 1.
 * @{
 */
#define MXC_F_I2C_TX_TXRDY_POS                         0 /**< TX_TXRDY Position */
#define MXC_F_I2C_TX_TXRDY                             ((uint32_t)(0x1UL << MXC_F_I2C_TX_TXRDY_POS)) /**< TX_TXRDY Mask */

#define MXC_F_I2C_TX_TXLAST_POS                        1 /**< TX_TXLAST Position */
#define MXC_F_I2C_TX_TXLAST                            ((uint32_t)(0x1UL << MXC_F_I2C_TX_TXLAST_POS)) /**< TX_TXLAST Mask */

#define MXC_F_I2C_TX_TXFIFO_POS                        8 /**< TX_TXFIFO Position */
#define MXC_F_I2C_TX_TXFIFO                            ((uint32_t)(0xFUL << MXC_F_I2C_TX_TXFIFO_POS)) /**< TX_TXFIFO Mask */

/**@} end of group I2C_TX_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_DATA I2C_DATA
 * @brief    Data Register.
 * @{
 */
#define MXC_F_I2C_DATA_DATA_POS                        0 /**< DATA_DATA Position */
#define MXC_F_I2C_DATA_DATA                            ((uint32_t)(0xFFUL << MXC_F_I2C_DATA_DATA_POS)) /**< DATA_DATA Mask */

/**@} end of group I2C_DATA_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_MCN I2C_MCN
 * @brief    Master Control Register.
 * @{
 */
#define MXC_F_I2C_MCN_START_POS                        0 /**< MCN_START Position */
#define MXC_F_I2C_MCN_START                            ((uint32_t)(0x1UL << MXC_F_I2C_MCN_START_POS)) /**< MCN_START Mask */

#define MXC_F_I2C_MCN_RESTART_POS                      1 /**< MCN_RESTART Position */
#define MXC_F_I2C_MCN_RESTART                          ((uint32_t)(0x1UL << MXC_F_I2C_MCN_RESTART_POS)) /**< MCN_RESTART Mask */

#define MXC_F_I2C_MCN_STOP_POS                         2 /**< MCN_STOP Position */
#define MXC_F_I2C_MCN_STOP                             ((uint32_t)(0x1UL << MXC_F_I2C_MCN_STOP_POS)) /**< MCN_STOP Mask */

#define MXC_F_I2C_MCN_SEA_POS                          7 /**< MCN_SEA Position */
#define MXC_F_I2C_MCN_SEA                              ((uint32_t)(0x1UL << MXC_F_I2C_MCN_SEA_POS)) /**< MCN_SEA Mask */

/**@} end of group I2C_MCN_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_CKL I2C_CKL
 * @brief    Clock Low Register.
 * @{
 */
#define MXC_F_I2C_CKL_CKL_POS                          0 /**< CKL_CKL Position */
#define MXC_F_I2C_CKL_CKL                              ((uint32_t)(0x1FFUL << MXC_F_I2C_CKL_CKL_POS)) /**< CKL_CKL Mask */

/**@} end of group I2C_CKL_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_CKH I2C_CKH
 * @brief    Clock high Register.
 * @{
 */
#define MXC_F_I2C_CKH_CKH_POS                          0 /**< CKH_CKH Position */
#define MXC_F_I2C_CKH_CKH                              ((uint32_t)(0x1FFUL << MXC_F_I2C_CKH_CKH_POS)) /**< CKH_CKH Mask */

/**@} end of group I2C_CKH_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_TO I2C_TO
 * @brief    Timeout Register
 * @{
 */
#define MXC_F_I2C_TO_TO_POS                            0 /**< TO_TO Position */
#define MXC_F_I2C_TO_TO                                ((uint32_t)(0xFFFFUL << MXC_F_I2C_TO_TO_POS)) /**< TO_TO Mask */

/**@} end of group I2C_TO_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_DMA I2C_DMA
 * @brief    DMA Register.
 * @{
 */
#define MXC_F_I2C_DMA_TXEN_POS                         0 /**< DMA_TXEN Position */
#define MXC_F_I2C_DMA_TXEN                             ((uint32_t)(0x1UL << MXC_F_I2C_DMA_TXEN_POS)) /**< DMA_TXEN Mask */

#define MXC_F_I2C_DMA_RXEN_POS                         1 /**< DMA_RXEN Position */
#define MXC_F_I2C_DMA_RXEN                             ((uint32_t)(0x1UL << MXC_F_I2C_DMA_RXEN_POS)) /**< DMA_RXEN Mask */

/**@} end of group I2C_DMA_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_SLA I2C_SLA
 * @brief    Slave Address Register.
 * @{
 */
#define MXC_F_I2C_SLA_SLA_POS                          0 /**< SLA_SLA Position */
#define MXC_F_I2C_SLA_SLA                              ((uint32_t)(0x3FFUL << MXC_F_I2C_SLA_SLA_POS)) /**< SLA_SLA Mask */
#define MXC_V_I2C_SLA_SLA_DIS                          ((uint32_t)0x0UL) /**< SLA_SLA_DIS Value */
#define MXC_S_I2C_SLA_SLA_DIS                          (MXC_V_I2C_SLA_SLA_DIS << MXC_F_I2C_SLA_SLA_POS) /**< SLA_SLA_DIS Setting */
#define MXC_V_I2C_SLA_SLA_EN                           ((uint32_t)0x1UL) /**< SLA_SLA_EN Value */
#define MXC_S_I2C_SLA_SLA_EN                           (MXC_V_I2C_SLA_SLA_EN << MXC_F_I2C_SLA_SLA_POS) /**< SLA_SLA_EN Setting */

#define MXC_F_I2C_SLA_EA_POS                           15 /**< SLA_EA Position */
#define MXC_F_I2C_SLA_EA                               ((uint32_t)(0x1UL << MXC_F_I2C_SLA_EA_POS)) /**< SLA_EA Mask */

/**@} end of group I2C_SLA_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32520_INCLUDE_I2C_REGS_H_
